# DisableAnalyticalModelCB Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisableAnalyticalModelCB Class
Members See Also
---
Disable the analytical model for a structural wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public class DisableAnalyticalModelCB : FailureResolution
```

Visual Basic
---
```text
Public Class DisableAnalyticalModelCB _
	Inherits FailureResolution
```

Visual C++
---
```text
public ref class DisableAnalyticalModelCB : public FailureResolution
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FailureResolution Autodesk.Revit.DB..::..DisableAnalyticalModelCB
# See Also
DisableAnalyticalModelCB Members
Autodesk.Revit.DB Namespace